10/data/attachments/ef4fc08c32befd20.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Mark_maybe_Friend_64492_0</nif:username>
            <nif:friendToBeRequested>soap_friends_2935d071-2063-4a52-a53a-1e27dd4dfeea</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>